content.org
#+TODO: TODO(t) | DONE(o)
#+HUGO_BASE_DIR: ./
#+HUGO_SECTION: ./
#+title: 麦汁三昧
#+author: mugijiru
#+MACRO: youtube @@html:<div class="org-youtube"><iframe width="600" height="337" src="https://www.youtube.com/embed/$1" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe></div>@@
*** DONE ember-rails アプリケーション保守入門              :@Rails:@Ember_js:
    CLOSED: [2021-05-24 月 09:02]
    :PROPERTIES:
    :EXPORT_FILE_NAME: ember-rails-introduction
    :END:
    ちょっとした事情で Ember.js 入門的なサムシングをすることになったけど
    どうせなら公開情報にしちゃえって気持ちになったので
    資料化する前にブログの記事にしちゃうぞ、というエントリです。

**** 想定する読者
     携わっているシステムが ember-rails を利用して作られているために
     令和になっても 2018 年にサポートが切れてしまった Ember.js@2.18 のアプリケーションを
     なんとか動かし続けないといけない哀れな子羊たち

**** 記事を書いている人
     Rails と Ember.js と Vue.js での開発をしたことがある人。
     React や Angular はやったことない。
     なので比較には Rails と Vue.js を出しがち

**** この記事で書かないこと
     既に存在してしまっている ember-rails アプリケーションの保守をする人達向けの記事なので、
     ember-rails を使って新規で Ember.js アプリを構築する、みたいなことは書きません。

     それに今更 ember-rails で構築するのはよろしくないですし、
     Rails で Ember.js やりたいなら [[https://github.com/thoughtbot/ember-cli-rails][ember-cli-rails]] にしておいた方が良いですよ。

     どうしても構築から知りたい人は
     [[https://github.com/mugijiru/ember-rails-todo-app/compare/9f190efb6320e19a80768b0c6a37e1929e9c4146...b18270e90c694f14e0fac5df2cb9aadad41376c5][ember-rails-todo-app で ember-rails アプリを構築したあたりのコミット]]
     を見たりとかしたらなんとなくわかるかもだけど
     まああんまり要らないよね。

**** Ember.js と ember-rails の簡単な紹介
***** Ember.js とは
      [[https://emberjs.com/][Ember.js]] はWebフロントエンドMVCフレームワークの1種。
      昔流行ったよね WebフロントエンドMVC。
      残念ながら最近はもう主流ではない。

      Ruby on Rails の影響を受けてるようなので、
      Rails エンジニアが取っ付きやすいフレームワークになっている。多分。

***** ember-rails とは
      [[https://github.com/emberjs/ember-rails][ember-rails]] は Ember.js をいい感じに Rails と連携してくれる素敵な Gem です。
      これを使うと Rails 上で動く Ember.js アプリケーションが簡単に作れる。

      Ember.js 自体が [[https://rubygems.org/gems/ember-source/versions/2.18.1?locale=ja][ember-source]] という Gem を提供してくれていたので
      それらのソースも依存関係で入って来てくれる便利なやつ。

      だけどそういう蜜月も Ember.js@2.18 の頃までのお話なので
      今から新規で Rails の上で Ember.js を触りたい子は
      大人しく [[https://github.com/thoughtbot/ember-cli-rails][ember-cli-rails]] を使いましょう。

**** Rails 側の設定

***** Gem の install
      #+begin_src ruby
      gem 'ember-rails'
      gem 'active_model_serializers', '~> 0.9.0'
      #+end_src

      多分このあたりを入れておけば良い。
      active_model_serializers は
      [[https://github.com/emberjs/ember-rails/blob/3ff45327d1320376715b365f0319192a35dc1d56/ember-rails.gemspec#L16][ember-rails の gemspec でバージョン指定がされてない]] けど
      Ember.js 側で使う active-model-adapter が 0.9 系対応なので
      バージョンをこちらで固定している。

      実は ember-rails-todo-app 1.x では
      [[https://github.com/mugijiru/ember-rails-todo-app/blob/21241d30fe4f9987760bd18bc2341b1943de26fe/Gemfile#L39-L42][jquery-rails や ember-source も指定している]] けど
      多分わざわざ指定しないでいい気もする。

***** config.handlebars.template_root
      ember-rails ではこれで指定されているフォルダが Ember.js の Template として利用される。
      デフォルト設定だと ~app/assets/javascriptes/templates~ が指定されている。

      複数の Ember.js App が動くようになってる場合には
      config/application.js あたりで複数設定されているはず。

      もし新しくテンプレートを放り込む場所を増やしたかったらここを弄る必要あり

**** Ember.js の基礎
***** EmberObject
      Ember.js では EmberObject というものが全体的に使われている。

      こいつは Ember.js で使う Class 的なやつのベースとなる機能を提供する。
      例えば Computed Property や Observer がそれにあたる。

      以下では EmberObject のよく使う機能について
      Vue.js の props, data, computed, watch, methods あたりと比較しながら解説する。

****** 通常のプロパティ
       Vue.js における data にあたるもの。

       EmberObject は、JS の Object でもあるので、
       普通に JS Object のプロパティとして定義したら Vue.js の data 的に扱える。

       #+begin_src js
       export default Ember.Object({
         width: 200,
         height: 200
       })
       #+end_src

       参照したり更新したりする時は

       #+begin_src js
       this.get('width') // 参照
       this.set('width', 300) // 更新
       #+end_src

       のような書き方になります。正直だるい。

       で、上で「Vue.js でいう data にあたるもの」と書いたが、
       Vue.js でいう props と data 的な区別は特にないので、
       外から簡単に書き換えられる値でもある。

******* 3系では
        3系だと EmberObject は使わなくなって JS の Native Class なので

        #+begin_src js
        width = 200
        height = 200

        hoge() {
          this.width = 200
        }
        #+end_src

        みたいな感じに書ける。

        また Vue.js でいう props 的なのは
        ~this.args~ の中に閉じ込められるし、
        値が変に上書きされることもない。便利。

****** Computed Property
       Vue.js の Computed Property のように
       通常のプロパティから新しい値を導出してプロパティとして使えるようにするやつ。
       Vue.js のそれと同様にキャッシュされるしリアルタイムに反映される。

       書き方は Vue.js よりちょっとだるくて

       #+begin_src js
       fullName: Ember.computed('firstName', 'lastname', function () {
         return `${this.get('firstName')} ${this.get('lastName')}`
       })
       #+end_src

       みたいな感じ。
       Vue.js だと

       #+begin_src js
       computed: {
         fullName() { return `${this.firstName} ${this.lastName}` }
       }
       #+end_src

       で済むのになって思うことはある。

       ただ、別名でも取れるようにしたり(alias)とか、全部足したり(sum)とかのよくあるやつは
       関数が定義済なので a と b を足した c が欲しい場合は

       #+begin_src js
       c: Ember.computed.sum('a', 'b')
       #+end_src

       とか書けるのでそれは便利かもしれない。
       https://api.emberjs.com/ember/2.18/modules/@ember%2Fobject#functions-computed

******* 3系では
        3.15 以降だと
        [[https://guides.emberjs.com/release/upgrading/current-edition/tracked-properties/][Tracked Property]] というのを使うのが推奨されている。
        まだ使えるけどね Computed も。

        `@tracked` というデコレータが付与されたプロパティは値の変更が検知されるようになる。

        また 3.15 以降では JS の Native Class になるので
        Tracked Property と Getter を使って

        #+begin_src js
        @tracked firstName
        @tracked lastName
        get fullName() { return `${this.firstName} ${this.lastName}` }
        #+end_src

        みたいに書ける。便利。
****** Observer
       Vue.js の watch のようなやつ。
       値を監視して、変更があったら関数が実行されるやつ。

       #+begin_src js
       Ember.Observer('hoge', function () {
         console.log('"hoge" is changed!')
       })
       #+end_src

       みたいな感じで使う。

******* 3系では
        Observer もまだ使えるけど、
        Tracked Property を使ってなんとかするのが推奨されている。

        上の例みたいにログだけ残したい時どうしたらいいんだろうね。

****** Methods
       これは普通に関数を書けばいいだけ。

       #+begin_src js
       hoge () {
         // なんらかの処理
       }
       #+end_src

       ~methods~ とかいうところに書かなくていい分 Vue.js より楽ではという気もする。

***** Handlebars
      Ember.js で採用されているテンプレートエンジンです。
      変数の呼び出しに ~{{foo}}~ みたいな感じにするやつです。

      Ember.js ではコンポーネントを呼び出す時にも
      ~{{my-component}}~ みたいに使います。

      上記の書き方はインラインコンポーネントの呼び出し方で
      ブロックコンポーネントは

      #+begin_src hbs
      {{#my-block-component}}
        ...
      {{/my-block-component}}
      #+end_src

      みたいな感じになります。

      変数を渡す時は

      ~{{my-component hoge=fuga}}~

      みたいな感じ。
      Vue.js と比べて見た目以外はそんなに変わらないかなって。

***** Ember.js のフォルダ・ファイル構成
      ここでは ember-rails を前提として話します。

      | フォルダ・ファイル    | 概要                                                              |
      | adapters              | サーバとの通信周りを設定するコードを置く場所                      |
      | components            | コンポーネント定義の JS ファイルを入れるところ                    |
      | controllers           | Rails でもお馴染みの Controller                                   |
      | initializers          | 初期化用コードを入れるところ                                      |
      | instance-initializers | アプリ起動直後の初期化コードを入れるところ                        |
      | helpers               | Rails でもお馴染みに Helper                                       |
      | mixins                | Rails だと Concern にあたるものを置くところ                       |
      | models                | Rails でもお馴染みの Model                                        |
      | routes                | Controller 実行前に Model などを取得したりするところ              |
      | routor.js             | Routing を設定するところ。Vue.js の Router と似てるかも?          |
      | serializers           | サーバと通信する前に形式変換するコードを置く場所                  |
      | templates             | Handlebars という HTML テンプレートを置く場所。Rails でいう views |
      | views                 | 使わない。Ember.js@1系の名残りかと                                |

**** Ember.js アプリにアクセスした時の処理の流れ
     ざっくり書くと

     1. EMBER_ROOT/application.js.es6 のコード実行
     2. EMBER_ROOT/{APP_NAME}.module.es6
     3. initializer 実行
     4. instance-initializer 実行
     5. routor/routes の実行
        1. beforeModel()
        2. model()
        3. afterModel()
     6. Controller の実行
     7. templates のレンダリング

     という流れ。
     これは Ember.js@3.26 でも大体似てる。1,2 あたりがちょっと違うけど。

