content.org
***** EMBER_ROOT/application.js.es6 のコード実行

      単にこのあたりで色々なものを require したり
      Ember.js App を呼び出したりしているのでここからスタートだよねってだけ。

      Sprockets で require した順に実行されるので、以下の順序は大事っぽい。

      #+begin_src js
      //= require ./environment
      //= require ember
      //= require ember-data
      //= require ember-rails/application
      //= require active-model-adapter
      #+end_src

***** EMBER_ROOT/{APP_NAME}.module.es6

      require でアプリケーション本体の色々なコードを読み込んだり
      設定を読み込んだりしている部分。

      require される対象は Class みたいなものなのであまり読込順は関係なさそう。

      module 化されてない場合は
      ~require router~ と ~require_self~ は最後じゃないとまずそうだけども。

***** initializer 実行

      Ember.js App の起動時に実行される処理。

      initializers フォルダに配置されていて

      #+begin_src js
      export function initializer(application) {
        ...
      }
      #+end_src

      みたいに書かれているファイルが実行される。
      アプリケーション初期化用のコード(ex: Websocket の初期化)とか
      DI で組込みたい service の injection のコードを入れておくと良いっぽい。

      initializer が複数ある場合の実行順はどうなってるかわからんけど
      [[https://guides.emberjs.com/v2.18.0/applications/initializers/#toc_specifying-initializer-order][「これより先に」「これより後で」みたいな指定]] はできる。

***** instance-initializer 実行

      Ember.js App が起動直後に動く処理。

      instance-initializers フォルダに配置されていて

      #+begin_src js
      export function instanceInitializer(application) {
        ...
      }
      #+end_src

      みたいに書かれているファイルが実行される。
      インスタンス化・起動後に動くので、
      A/B テストみたいに見ている人毎に違う条件を埋め込むとかしたい時に使うのが良いらしい。

***** routor/routes の実行

      初期化処理が済んだら routor が実行される。

      #+begin_src js
      Router.map(function () {
        this.route('root', { path: '/' })
        this.route('posts', { path: '/posts' }, function () {
          this.route('new')
        })
      })
      #+end_src

      みたいに書かれていて、
      path にマッチした route が実行されるようになっている。
      Vue Router なんかもそういう作りだよね。

      Ember.js の Router は Vue Router とは違って直接コンポーネントが呼び出されるのではなく
      routes 以下にある Route が呼び出されるようになっている。
      読まれるファイルは ~this.route~ の第一引数にマッチしたやつですね。

      上の例では ~/~ というところにアクセスした場合には
      ~routes/root.module.es6~ が実行されるという仕組み。

****** beforeModel()

       ~model()~ が実行されるより前に動く処理。
       ログイン状態チェックしてログインしてなければ別のルートに飛ばす、
       みたいに、あまりアプリケーションのModelと関係ない処理をする時に使えば良さそう。

       正直あまり出番ない。

****** model()

       その画面で使う Model を取得する処理。
       ここで return された値が Controller や Template で model としてアクセスできるようになる。

       また Promise を返した場合は、それが解決された時の戻値を model として使えるようにしてくれる。

       store.findAll などは Promise を返すが、
       Promise の解決結果を Model とする挙動のおかげで

       #+begin_src js
       model() {
         return this.store.findAll('posts')
       }
       #+end_src

       とした場合に Controller などでは ~this.get('model')~ で ~posts~ が取得できるようになっている。

******* 複数の model

        1画面で複数の Model を使いたい場合には

        #+begin_src js
        return {
          foo: hoge,
          bar: fuga
        }
        #+end_src

        みたいに書けば良い。

        Controller とかで ~this.get('model.foo')~ みたいにして扱える。

****** afterModel(model)

       model を取得した後で、画面を表示する前にやっておきたい処理を書くところ。
       第一引数で model が渡されてくるので、
       model の状態を見て別の route に飛ばすとか、controller に値を放り込むとかの処理ができる。

****** 入れ子になった Route

       上の例にも書いたけど Route はネストさせることもできる。

       例えば ~/posts/new~ という route の場合は
       画面表示的には ~/posts~ というレイアウトの中に登録フォームを表示する、
       みたいな時に使う

       このあたりは [[https://router.vuejs.org/ja/guide/essentials/nested-routes.html][Vue Router の Nested Route]] と似てるよね。
       どっちが先か知らんけど。

       で、そうやってネストさせている場合は、一番外側の Route から順に実行されるような感じになっている。

       つまり上記の例だと ~posts.module.es6~ の ~model()~ なんかが実行された後に
       ~/posts/new.module.es6~ の内容が実行される。

       上位の path の route が既に実行されているので
       下位の path で上位の model 情報を使いたい場合、
       上記の例だと ~/posts/new~ で ~posts~ の model 情報を使いたい場合には
       [[https://api.emberjs.com/ember/3.26/classes/Route/methods/modelFor?anchor=modelFor][modelFor()]] という関数で ~const posts = modelFor('posts')~ みたいに取得できる。

***** Controller の実行
      Route での処理が済んだら Controller の処理が実行される。
      というか Route から [[https://api.emberjs.com/ember/release/classes/Route/methods/setupController?anchor=setupController][setupController]] というので呼び出される。

      呼び出される Controller は route と同じように path にマッチしたやつになる。
      つまり ~/posts~ という path なら
      ~controllers/posts.module.es6~ で定義している Controller が呼び出される。

      Controller では Template で使う値を設定したり Action を定義したりする。

***** Template のレンダリング
      Controller の処理が済んだら Template のレンダリングに入る。
      呼び出される Template は Controller の path と一致する。

      つまり ~/posts~ という path なら ~templates/posts.hbs~ が呼び出される。

      Template は Handlebars 形式で記述する。

**** Ember.js の Component
     Ember.js の開発で一番弄る機会の多いのが Component です。

     components フォルダに JS のロジックが書かれたファイルが置かれ、
     対応するテンプレートは、
     templates/components フォルダに Handlebars で記述した hbs ファイルとなる。

     JS のロジックが書かれる Component は [[*EmberObject][EmberObject]] がベースなのでそれらの機能が使える。
     さらに Component 用の機能が追加されている。

***** 値の渡し方
      [[*Handlebars][Handlebars]] の方でも書いたけど
      ~{{my-component hoge=fuga}}~ というように書けば良いです。

      そうすると MyComponent 内で
      ~this.get('hoge')~ で値が取得できるようになり、
      そのテンプレート内で ~{{hoge}}~ で参照できるようになります。
***** Component のタグのカスタマイズ
      古い Ember.js では Component を呼び出すと
      Wrapper となる div が挿入されてその中に Template で書いた記述が入るようになっています。

****** tagName
       Wrapper のタグを指定する。
       ul の下にリストアイテムをコンポーネントとして配置したい時は
       ~tagName: 'li'~ とかやったりする。

****** classNames
       Wrapper タグに付与する class のリスト。
       こちらは固定の値になる。
****** classNameBindings
       Wrapper タグに、条件に応じて付与する class のリスト的な。
       Vue.js の class の Binding に似ていて

       #+begin_src js
       isActive: false
       classNameBindings: ['isActive:active']
       #+end_src

       みたいに書くと isActive が true の時に `active` というクラスが付与される。

       Vue.js だと

       #+begin_src html
       <div :class="{ active: isActive }">
       #+end_src

       となるので書き方が逆だけどね。

****** 3系では
       3.15 以降では Vue のコンポーネント同様に余計な Wrapper が入らなくなります。
       なので tagName, classNames, classNameBindings とは全ておさらばとなります。

***** Actions
      テンプレート内のボタンを叩いた時に動かしたい関数なんかを記述するところ。

      #+begin_src js
      actions: {
        hoge(){
          // なんか処理を書く
        }
      }
      #+end_src

      みたいな感じで書く。

****** Template で直接使う場合
       Template から直接アクションを呼びたい時は

       #+begin_src hbs
       <button type="}button" {{action "hoge"}}>
       #+end_src

       みたいに書くと、そのボタンを押した時に hoge アクションが動く。
       https://guides.emberjs.com/v2.18.0/components/triggering-changes-with-actions/#toc_designing-the-child-component

****** 下位のコンポーネントに渡す場合

       #+begin_src hbs
       {{child-component foo=(action "hoge")}}
       #+end_src

       というように書いて渡すと、child-component では
       foo というメソッドが定義されていて、その実体は親コンポーネントで定義した hoge アクション、という状態になる

       なので child-component 内のアクションを

       #+begin_src
       actions: {
         fuga() {
           this.get('foo')()
         }
       }
       #+end_src

       というように書いて child-component のテンプレートで fuga アクションを実行したら
       親コンポーネントの hoge アクションが実行される、みたいな挙動になる

       参考: https://guides.emberjs.com/v2.18.0/components/triggering-changes-with-actions/#toc_passing-the-action-to-the-component

***** LifeCycle Hooks
      [[https://guides.emberjs.com/v2.18.0/components/the-component-lifecycle/][なんかめっちゃ Hook が用意されている。]]

****** 初期化時
       1. init
       2. didReceiveAttrs
       3. willRender
       4. didInsertElement
       5. didRender

       init と didRender あたりは割と使うかな?
       didRender は再描画でも使うので
       両方に適用したい時に使う感じ。

       didInsertElement もたまに使う気がする。

****** 再描画時
       1. didUpdateAttrs
       2. didReceiveAttrs
       3. willUpdate
       4. willRender
       5. didUpdate
       6. didRender

       didRender は割と使う。
       didUpdate は初期化時には動かしたくないけど didRender 的に使いたい時に使う感じ。
       他はあまり使った記憶なし。

****** 破壊時
       1. willDestroyElement
       2. willClearRender
       3. disDestroyElement

       このあたりはあまり使った記憶がない

