content/posts/ember-rails-introduction.md


#### Hook の使い方 {#hook-の使い方}

使い方は2種類あって

```js
init () {
  this._super(...arguments) // 通常の処理をさせておく
  // ここに特別な処理を書く
}
```

というように hook 関数を Override する方法と

```js
hoge: Ember.on('init', functoin () {
  // ここに特別な処理を書く
})
```

というように [on メソッド](https://api.emberjs.com/ember/2.18/functions/@ember%2Fobject%2Fevented/on) を使う方法がある。

Rails の Model で

```ruby
after_save do
  # ここに特別な処理を書く
end
```

と書くか

```ruby
after_save :hoge

private
def hoge
  # ここに特別な処理を書く
end
```

と書くかの違いみたいなものですね。

私は後者の方が好み。間違えて二重定義したりしなさそうだし `this._super(...arguments)` を呼び忘れもしなさそうなので。

まあ前者の方が `this._super` の呼び出しタイミングをズラせる自由さはあるけどね。


### Block Component {#block-component}

[Block Component](https://guides.emberjs.com/v2.18.0/components/block-params/) では

my-component のテンプレートを

```hbs
<div>
  {{yield}}
  ↑親から来たやつ↑
</div>
```

みたいに書いてる状態で親から

```hbs
{{#my-component}}
  hogehoge
{{/my-component}}
```

みたいに呼び出すと

```html
<div>
  hogehoge
  ↑親から来たやつ↑
</div>
```

という感じになるやつ。

Rails のテンプレートの yield と似てる気がするよね。あと Vue.js の slot にも似てる気がするよね。複数 Slot みたいなことはできなさそうだけども。

本当はもうちょっと複雑なこともできるんだけど入門記事だしそこまで書くのはだるいので割愛。というか [Block Component](#block-component) のリンク先読んで。


### フォルダ階層分け {#フォルダ階層分け}

最新の Ember.js だと素直にいけるのに ember-rails かつ古い書き方だと苦労する問題の1つ。

[ember-rails でコンポーネントをサブフォルダに配置する]({{< relref "ember-rails-component-in-subfolder" >}}) に全部書いているけどざっくり書くと
template で `{{hoge/fuga}}` というように呼び出した場合に
GlobalResolver では Hoge という名前空間の Fuga というコンポーネントを探しに行くようになっている。

つまりコンポーネントを
`App.HogeFugaComponent` ではなく
`Hoge.FugaComponent` として定義する必要がある。そして名前空間 Hoge を `window.Hoge = Ember.Namespace.create()` みたいにして用意しておく必要もある。だるい。

試したことはないけど、さらに1階層増やすとしたら、また同じようにすることになりそうでさらにだるそう。


### 3系でのテンプレートの配置 {#3系でのテンプレートの配置}

3.15 以降では components に hbs を置けるようになるよ。
JS ファイルと場所が近くて便利。

さらに [Pods layout](https://cli.emberjs.com/release/advanced-use/project-layouts/#podslayout) という構成が使えて機能群毎にまとめるのが便利になる。

Pods layout はコンポーネントだけではなくて
model, controller とかの構成もフォルダに閉じ込められるので多分便利。まだ試したことないけど。


## Model(Ember Data) {#model--ember-data}

大体 Route で Controller にセットされる子。
Rails の Model に似せて作られている。

[EmberObject](#emberobject) ベースで作られているので、当然そのあたりの機能も使える。
computed とかね。


### Store の操作 {#store-の操作}

データを取得したりまとめて消したりする際に使う。
Rails でいうと ActiveRecord モデルの Class Method を叩く感じ。

参考: <https://api.emberjs.com/ember-data/2.18/classes/DS.Store>

以下ではよく使うものをピックアップして簡単な説明をしています。


#### findAll/peekAll {#findall-peekall}

どちらも対象のレコードを全件取得するメソッド。

違いは peekAll の方はフロントエンドの Store 内の検索に留まり、
findAll はデータがなければサーバにまで取りに行く。

`store.findAll('user')` みたいに使う。


#### findRecord/peekRecord {#findrecord-peekrecord}

findAll/peekAll のレコード単体版。違いも同じ。

`store.findRecord('user', 1)` とすると
id が 1 の User を探しに行く。


#### query/queryRecord {#query-queryrecord}

findAll ではクエリパラメータを付けられないので検索画面などは作れない。そんな場合は query を使うとパラメータを付与してリクエストを投げられる。それの単体レコード版が queryRecord となる。


#### create {#create}

```js
this.store.create('user', { firstName: 'Taro', lastName: 'Yamada' })
```

みたいな感じでデータを作成できる。


#### push/pushPayload {#push-pushpayload}

push は Object から Store にレコードを作る処理。

```js
store.push({
  {
    "user": {
      "id": 1,
      "first_name": "Taro",
      "last_name": "Yamada"
    }
  }
});
```

とかやるとレコードが Store 上に作られる。無理矢理サーバから持って来たデータを Store に突っ込む時に使う。

pushPayload はそれの便利版で

```nil
{
  "users": [{
    "id": 1,
    "first_name": "Taro",
    "last_name": "Yamada"
  }],
  "posts": [{
    "id": 1,
    "title": "Awesome Blog Post",
    "body": "..."
  }]
}
```

みたいなのを受け取ると users と posts をそれぞれ複数レコード登録してくれる。

<!--list-separator-->

-  注意

    push/pushPayload の例で書いている JSON は ember-rails で使う active-model-adapter 前提で書いています。デフォルトだと JSON:API 形式を受け付けるようになっています。


### Model の操作 {#model-の操作}

peekRecord などで取得した Model に対しての操作。更新したり削除したりはこれで行う。

参考: <https://api.emberjs.com/ember-data/2.18/classes/DS.Model>

以下ではよく使うものをピックアップして簡単な説明をしています。


#### save {#save}

取得したデータは set で値を書き換えて save で保存できる。

```js
const user = this.store.findRecord('user', 1)
user.set('firstName', 'Taro')
user.save()
```

save は Promise を返すので、保存後に何か処理をしたければ

```js
user.save().then((savedUser) => { /* 保存成功時の処理 */ }, (error) => { console.log(error) })
```

みたいなことができる。


#### destroyRecord {#destroyrecord}

```js
const user = this.store.findRecord('user', 1)
user.destroyRecord()
```

みたいな感じで削除できる。

save と同様に callback も受け付けている。


#### unloadRecord {#unloadrecord}

unloadRecord はサーバの実データは消しに行かずフロントエンドの Store から捨てるだけ。


#### reload {#reload}

サーバからデータを読み直す。


### Model の定義 {#model-の定義}


#### attr {#attr}

`firstName: DS.attr()` みたいに定義するやつ。
API から取って来た値をそのまま放り込む感じである。


#### belongsTo {#belongsto}

`user: DS.belongsTo('user')`
って書いたら `this.get('user')` と指定した時に userId から適切なデータを探してくる感じ。
Rails と似てますね。

`user: DS.belongsTo('user', { async: false })`
としておけばサーバには探しに行かなくなるっぽい。対応するエンドポイントを用意してない時なんかはそうしておいた方が良い。


#### hasMany {#hasmany}

`posts: DS.hasMany('posts')`
って書いたら関連する posts を `this.get('posts')` で取ってこれるようになる。
Rails と似てますね。

`posts: DS.hasMany('posts, { async: false })`
としておけばサーバには探しに行かなくなる。
hasMany の関連先のレコードが多い時なんかはまとめて取らない方がいいのでこの方が便利。

その場合、別で取得する方法を考えた方が良い。


#### 3系では {#3系では}

-   `@attr firstName`
-   `@belongsTo('user') user`
-   `@hasMany('post') posts`

みたいにデコレータで定義する。
option の async などをつける場合は `@belongsTo('user', { async: false }) user` みたいな感じ。


## Adapter/Serializer {#adapter-serializer}

どっちも普段あまり触らないところなので簡単に。

Adapter がサーバへのアクセス方法を色々設定するところ。どのホストにアクセスするかとか、どの PATH にアクセスするかとか
HTTP Header で何か渡すならそれを設定するとか。

Serializer がデータ形式を変換するところ。
JS 側では camelCase のキーを、サーバに渡す時には dashlize したり逆に dashlize されてるキーを貰う時は camelize したり。


## Controller {#controller}

Rails の Controller とは結構違う役割の子。
Rails ベースで考えると混乱する。

Route と関連する特別な Component みたいな扱いなので
Component の扱いをベースに触った方が良い。

Component に近い立場なので各種 hook だったり actions だったりが使える。

tagName や className などは使えるか調べたこともないのでわからない。

コンポーネントツリーの根っこの Component みたいな感じなので大分カオスになりがちなやつ。

正直そのカオスをどう解消したらいいかまだ分かってないが、恐らくここではページ全体に関するロジックだけを詰めておき、
Component に直接 Service Object を Inject して、その Service Object にロジックを詰めておいた方が良いんじゃないかなと考えている。どこかで試してみたい。


## Service Object {#service-object}

各 Component や Controller に Inject して使う便利な Object です。
Vue.js でいうと Vuex ぐらいどこでも使えて便利。つまり無闇にあちらこちらに Inject するとそれはそれでカオスになる系。

アプリケーション全体で使うような、例えば EC サイトだと shopping-cart を Service で実装しておいて各 Component で Inject する、みたいな感じで使う。


## 色々な罠達 {#色々な罠達}


### Ember.js の Guide {#ember-dot-js-の-guide}

ember-rails だと Ember.js@2.18 までなので
<https://guides.emberjs.com/v2.18.0/>
などの古いバージョンのガイド読みましょう。

っていうか古いバージョンのも全部残っててありがたいよね。

ただ ember-rails でも古い書き方をしていると
import とか使えないのでそのあたりは読みにくいと思う。
import とかを使ってないのは 1.10 ぐらいの書き方だから……。


### active\_model\_serializers という Gem の 0.10 系で動きません>< {#active-model-serializers-という-gem-の-0-dot-10-系で動きません}

ember-rails では active\_model\_adapter というのを Ember.js 側で使っています。そしてそれに適合する active\_model\_serializers gem は 0.9系となっています。というわけで 0.9 系を使いましょう。


### コンポーネント呼び出し階層が深いので Controller の Action を叩くのがしんどいです {#コンポーネント呼び出し階層が深いので-controller-の-action-を叩くのがしんどいです}

その Action を Controller じゃなくて Service に移動して
Component に Service を Inject して使うようにしたら良いかもしれません。

Vue.js でいうと Vuex をあちらこちらから叩くとカオスになるように、
Service の Inject もやりすぎるとそれはそれでカオスになりそう。


### mixins に色々置いて共通化ウェーイ {#mixins-に色々置いて共通化ウェーイ}

それあなた Rails でも Concerns に置いて後々苦労したりしませんでしたか?
あんまり Mixin に頼るとつらいので Service に逃がすなど検討しましょう


### ember コマンドを使いたい {#ember-コマンドを使いたい}

ember-cli-rails に乗り換えましょう。
[ember-rails から ember-cli-rails へ]({{< relref "migrate-ember-rails-to-ember-cli-rails" >}}) でその方法書いてるので参考にどうぞ。


### Addon を入れたい! 便利そう! {#addon-を入れたい-便利そう}

ember-rails では無理です。
ember-cli-rails に乗り換えましょう。
