content.org
***** Webpack 使えないの?
      ember-rails なら諦めましょう。
      そうじゃない場合も諦めた方がいいです。

      [[https://github.com/embroider-build/embroider][Embroider]] というプロジェクトで Webpack とか Rollup とかと連携できるように頑張ってるみたいですが
      まだ v1 がリリースされてないのでプロダクションで使うには罠がまだまだ多そうです。

***** Ember.js の単体テストを書きたい……!
      ember-rails でしたら諦めてください。

      ember-cli なら QUnit または Mocha あたりでテストが書けるので
      ember-cli-rails に乗り換えましょう。

      Ember.js 自体に黒魔術が多いようで Jest ではテストが書けませんので Jest 派はお疲れ様でした

***** CSS も Ember.js 内で書きたい!
      ember-rails なら諦めて ~RAILS_ROOT/app/assets/stylesheets~ あたりで書きましょう。おつかれさまでした。

      ember-cli を使っていたら ~EMBER_ROOT/app/styles/~ 以下に置けるらしいよ。
      https://cli.emberjs.com/release/advanced-use/stylesheets/

***** Resolver のソースってどれ?
      ember-rails をお使いで、かつ古い書き方をしているみなさんは
      ember-source の中にある GlobalResolver をお読み下さい。以上。

      ember-cli で Ember.js アプリを構築している先進的な皆様は
      Ember.js の中にある GlobalResolver ではなくて ember-resolver という Addon を見ましょう。
      ただそいつはそいつで GlobalResolver を継承しているので
      結局 GlobalResolver のソースも読まないといけないという罠がある。

      まあ v4 あたりでは継承やめるって話あるけどね
**** 最後に
     ember-rails のまま保守し続けるよりは
     ember-cli-rails に移行して3系にした方が幸せになれそうなので是非ご検討ください。

     そのあたりの対応方法は、私が書いた記事ですが、

     - [[*ember-rails から ember-cli-rails へ][ember-rails から ember-cli-rails へ]]
     - [[*ember-cli-rails の Ember.js を 2.18 から 3.4 にアップデート][ember-cli-rails の Ember.js を 2.18 から 3.4 にアップデート]]
     - [[*Ember.js@3.4 から最新の 3.26 に上げた][Ember.js@3.4 から最新の 3.26 に上げた]]

     あたりが参考になるかもです。
